app/views/gossips/index.html.erb

	<br><div class="card-columns">
		<% Gossip.all.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips"

					<small class="text-muted">
						<%= gossip.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]