app/views/gossips/show.html.erb

    <h1>Hot Gossip n°<%= @gossip.id %></h1><br>
    <p><b>Auteur : </b><%= @gossip.user.first_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]