app/views/home/show.html.erb

SELECT "gossips".* FROM "gossips"
---
	<br><div class="card-columns">
		<% Gossip.all.each do |gossip| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
---
					<small class="text-muted">
						<%= gossip.user.first_name %>