app/controllers/gossips_controller.rb

	def index
		@gossips = Gossip.all
---
SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" DESC LIMIT $1  [["LIMIT", 1]]

	def show
		@gossip = Gossip.find(params[:id])
		@auteur = User.find("#{@gossip.user_id}")
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]

	def update
		@gossip = Gossip.find(params[:id])
		gossip_params = params.require(:gossip).permit(:title,:content)
		@gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "Gerald Broflovski"], ["content", "ijzpfhi"], ["updated_at", "2020-02-13 15:42:29.510458"], ["id", 21]]

	def create
		puts params
		@gossip = Gossip.create(title:params[:gossip][:title], content: params[:gossip][:content], user_id: User.all.ids.sample)
		@gossip.user = User.find_by(id: session[:user_id])
---
INSERT INTO "gossips" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 7], ["created_at", "2020-02-13 15:42:09.194634"], ["updated_at", "2020-02-13 15:42:09.194634"]]
SELECT "users"."id" FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]