app/controllers/home_controller.rb

  def show
  	 @gossip = Gossip.all
---
SELECT "gossips".* FROM "gossips"