app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "age", "email", "description", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
 	def create
 		user = User.create(user_params)